tutorials/coupled/conjugateHeatFoam/conjugateCavity/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 273;

boundaryField
{
    movingWall
    {
        type            adiabatic;
        K               kappaEff;
        value           uniform 273;
    }

    left
    {
        type            fixedValue;
        value           uniform 273;
    }

    right
    {
        type            chtRcTemperature;
        radiation       on;
        K               kappaEff;
        remoteField     T;
        value           uniform 273;
    }

    bottom
    {
        type            adiabatic;
        K               kappaEff;
        value           uniform 273;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
